app/controllers/adminsters_controller.rb

	def manage_users
		@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

	def show_user
		@user = User.find(params[:id])
		@orders = @user.orders.page(params[:page]).reverse_order
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."user_id" = ? ORDER BY "orders"."id" DESC LIMIT ? OFFSET ?  [["user_id", 4], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 4]]

	def edit_user_details
		@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

	def update
		@user = User.find(params[:id])
		if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "address" = ?, "phone" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["address", "住所　7"], ["phone", ""], ["updated_at", "2017-12-22 12:30:03.531325"], ["id", 1]]

	def destroy
		user = User.find(params[:id])
        user.update_attribute(:leave, false)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "users" SET "leave" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["leave", "f"], ["updated_at", "2017-12-23 03:00:41.023546"], ["id", 7]]